feaser/openblt/stm32u5_port/Target/Demo/TRICORE_TC3_TC375_Lite_Kit_ADS/Boot/Libraries/iLLD/TC37A/Tricore/Evadc/Adc/IfxEvadc_Adc.h
/**
 * \file IfxEvadc_Adc.h
 * \brief EVADC ADC details
 * \ingroup IfxLld_Evadc
 *
 * \version iLLD_1_0_1_12_0_1
 * \copyright Copyright (c) 2019 Infineon Technologies AG. All rights reserved.
 *
 *
 *                                 IMPORTANT NOTICE
 *
 * Use of this file is subject to the terms of use agreed between (i) you or
 * the company in which ordinary course of business you are acting and (ii)
 * Infineon Technologies AG or its licensees. If and as long as no such terms
 * of use are agreed, use of this file is subject to following:
 *
 * Boost Software License - Version 1.0 - August 17th, 2003
 *
 * Permission is hereby granted, free of charge, to any person or organization
 * obtaining a copy of the software and accompanying documentation covered by
 * this license (the "Software") to use, reproduce, display, distribute,
 * execute, and transmit the Software, and to prepare derivative works of the
 * Software, and to permit third-parties to whom the Software is furnished to
 * do so, all subject to the following:
 *
 * The copyright notices in the Software and this entire statement, including
 * the above license grant, this restriction and the following disclaimer, must
 * be included in all copies of the Software, in whole or in part, and all
 * derivative works of the Software, unless such copies or derivative works are
 * solely in the form of machine-executable object code generated by a source
 * language processor.
 *
 * THE SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR
 * IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY,
 * FITNESS FOR A PARTICULAR PURPOSE, TITLE AND NON-INFRINGEMENT. IN NO EVENT
 * SHALL THE COPYRIGHT HOLDERS OR ANYONE DISTRIBUTING THE SOFTWARE BE LIABLE
 * FOR ANY DAMAGES OR OTHER LIABILITY, WHETHER IN CONTRACT, TORT OR OTHERWISE,
 * ARISING FROM, OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER
 * DEALINGS IN THE SOFTWARE.
 *
 * \defgroup IfxLld_Evadc_Adc_Usage How to use the EVADC ADC Interface driver?
 * \ingroup IfxLld_Evadc
 *
 * EVADC comprises of independent analog channels with Analog/Digital converters to convert analog input to discrete digital output.
 *
 * In the following sections it will be described, how to integrate the driver into the application framework.
 *
 * \section IfxLld_Evadc_Adc_Preparation Preparation
 * \subsection IfxLld_Evadc_Adc_Include Include Files
 *
 * Include following header file into your C code:
 * \code
 *
 * #include <Evadc/Adc/IfxEvadc_Adc.h>
 *
 * \endcode
 *
 * \subsection IfxLld_Evadc_Adc_Variables Variables
 * \code
 *
 * // EVADC handle
 * IfxEvadc_Adc evadc;
 * IfxEvadc_Adc_Group adcGroup;
 * \endcode
 *
 * \subsection IfxLld_Evadc_Adc_ModuleInitialisation Module Initialisation
 * The module initialisation can be done in the same function:
 * \code
 *     // create configuration
 *     IfxEvadc_Adc_Config adcConfig;
 *     IfxEvadc_Adc_initModuleConfig(&adcConfig, &MODULE_EVADC);
 *
 *     // initialize module
 *     // IfxEvadc_Adc evadc; // declared globally
 *     IfxEvadc_Adc_initModule(&evadc, &adcConfig);
 * \endcode
 *
 *
 * \subsection IfxLld_Evadc_Adc_GroupInitialisation Group Initialisation
 * The group initialisation can be done in the same function.
 * NOTE: By default startupCalibration = FALSE in IfxEvadc_Adc_initGroupConfig() and startupCalibrationControl = IfxEvadc_StartupCalibration_noAction in IfxEvadc_Adc_initModuleConfig().
 *
 * In case startup calibration is required, while configuring the last group, startupCalibration inside group config structure must be set to TRUE after calling IfxEvadc_Adc_initGroupConfig() and before calling IfxEvadc_Adc_initGroup().
 *
 * \code
 *
 * // create group config
 *     IfxEvadc_Adc_GroupConfig adcGroupConfig;
 *     IfxEvadc_Adc_initGroupConfig(&adcGroupConfig, &evadc);
 *
 *     // change group (default is GroupId_0, change to GroupId_3)
 *     adcGroupConfig.groupId = IfxEvadc_GroupId_3;
 *     adcGroupConfig.master = adcGroupConfig.groupId;
 *     adcGroupConfig.startupCalibration =TRUE;
 *
 *     // enable all arbiter request sources
 *     adcGroupConfig.arbiter.requestSlotQueue0Enabled           = TRUE; // enable Queue0 mode
 *     adcGroupConfig.arbiter.requestSlotQueue1Enabled           = TRUE; // enable Queue1 mode
 *     adcGroupConfig.arbiter.requestSlotQueue2Enabled           = TRUE; // enable Queue2 mode
 *
 *     // enable all gates in "always" mode (no edge detection)
 *     adcGroupConfig.queueRequest[0].triggerConfig.gatingMode = IfxEvadc_GatingMode_always;
 *     adcGroupConfig.queueRequest[1].triggerConfig.gatingMode = IfxEvadc_GatingMode_always;
 *     adcGroupConfig.queueRequest[2].triggerConfig.gatingMode = IfxEvadc_GatingMode_always;
 *
 *
 *
 *     // initialize the group
 *     //IfxEvadc_Adc_Group adcGroup;//declared globally
 *     IfxEvadc_Adc_initGroup(&adcGroup, &adcGroupConfig);
 *
 * \endcode
 *
 * \subsection IfxLld_Evadc_Adc_QueuedTransfers Queued Transfers
 * Now, EVADC is initialised. Here,Three channels are used for queued transfers
 * \code
 *     // IMPORTANT: for deterministic results we have to disable the queue gate
 *     // while filling the queue, otherwise results could be output in the wrong order
 *
 *         IfxEvadc_RequestSource requestSource = IfxEvadc_RequestSource_queue0;
 *
 *         IfxEvadc_GatingMode savedGate =  IfxEvadc_getQueueSlotGatingMode(adcGroup.group,requestSource);
 *         IfxEvadc_GatingSource gatingSource = IfxEvadc_getQueueSlotGatingSource(adcGroup.group, requestSource );
 *
 *          IfxEvadc_setQueueSlotGatingConfig(adcGroup.group, gatingSource, IfxEvadc_GatingMode_disabled, requestSource );
 *     // create channel config
 *     IfxEvadc_Adc_ChannelConfig adcChannelConfig[3];
 *     IfxEvadc_Adc_Channel adcChannel[3];
 *
 *     for(int chnIx=0; chnIx<3; ++chnIx) {
 *         IfxEvadc_Adc_initChannelConfig(&adcChannelConfig[chnIx], &adcGroup);
 *
 *         adcChannelConfig[chnIx].channelId = (IfxEvadc_ChannelId)(chnIx);
 *         adcChannelConfig[chnIx].resultRegister = IfxEvadc_ChannelResult_1; // use result register #1 for all channels
 *
 *         // initialize the channel
 *         IfxEvadc_Adc_initChannel(&adcChannel[chnIx], &adcChannelConfig[chnIx]);
 *
 *         // Add channel to queue with refill enabled
 *             IfxEvadc_Adc_addToQueue(&adcChannel[chnIx], requestSource, IFXEVADC_QUEUE_REFILL);
 *         }
 *
 *         // restore previous gate config
 *
 *          IfxEvadc_setQueueSlotGatingConfig(adcGroup.group, gatingSource, savedGate, requestSource );
 *
 *         // start the Queue
 *         IfxEvadc_Adc_startQueue(&adcGroup, requestSource); // just for the case that somebody copy&pastes the code - the queue has already been started in previous test
 *
 *         // get 10 results for all 3 channels and store in temporary buffer
 *         // (the usage of a buffer is required, since the print statements used by the checks take more time than the conversions)
 *         Ifx_EVADC_G_RES resultTrace[3*10];
 *         for(int i=0; i<3*10; ++i)
 *         {
 *             unsigned chnIx = i % 3;
 *
 *             // wait for valid result
 *             Ifx_EVADC_G_RES conversionResult;
 *             do {
 *                 conversionResult = IfxEvadc_Adc_getResult(&adcChannel[chnIx]);
 *             } while( !conversionResult.B.VF );
 *
 *             // store result
 *             resultTrace[i] = conversionResult;
 *         }
 *
 *         // stop the queue
 *         IfxEvadc_Adc_clearQueue(&adcGroup, requestSource);
 *
 *         // check results in buffer
 *  // ...
 *
 * \endcode
 *
 * \subsection IfxLld_Evadc_Adc_EmuxConfiguration External Multiplexer Configuration
 * External Configuration of 3 channels at channel 3
 *
 * \code
 *
 *       IfxEvadc_Adc_EmuxControl emuxConfig;
 *
 *         IfxEvadc_Adc_initExternalMultiplexerModeConfig(&emuxConfig,evadc);
 *
 *         emuxConfig.groupId           = IfxEvadc_GroupId_1;
 *         emuxConfig.channels          = (uint8)IfxEvadc_ChannelId_3;
 *         emuxConfig.startChannel   = IfxEvadc_EmuxSelectValue_2; // it will take 0 to 2 external channel
 *
 *         emuxConfig.sampleTimeControl = IfxEvadc_EmuxSampleTimeControl_always;
 *         emuxConfig.mode              = IfxEvadc_ExternalMultiplexerMode_steady;
 *
 *         IfxEvadc_Adc_EmuxPinConfig pinsConfig ={
 *  .pins={ &IfxEvadc_EMUX00_P02_6_OUT,
 *          &IfxEvadc_EMUX01_P02_7_OUT,
 *          &IfxEvadc_EMUX02_P02_8_OUT},
 *
 *
 *         .outputMode = IfxPort_OutputMode_pushPull,
 *         .padDriver  = IfxPort_PadDriver_cmosAutomotiveSpeed1
 *  };
 *         emuxConfig.emuxOutPinConfig = pinsConfig;
 *
 *         IfxEvadc_Adc_initExternalMultiplexerMode(evadc, &emuxConfig);
 *
 *         IfxEvadc_setEmuxGroupResolution(&evadc->G[emuxConfig.groupId], 0, IfxEvadc_ChannelResolution_12bit);
 *         IfxEvadc_setEmuxGroupSampletime(&evadc->G[emuxConfig.groupId], 0, 50000, 1.0e-6);
 *
 * \endcode
 *
 * \defgroup IfxLld_Evadc_Adc Interface Driver
 * \ingroup IfxLld_Evadc
 * \defgroup IfxLld_Evadc_Adc_DataStructures Data Structures
 * \ingroup IfxLld_Evadc_Adc
 * \defgroup IfxLld_Evadc_Adc_Module Module Functions
 * \ingroup IfxLld_Evadc_Adc
 * \defgroup IfxLld_Evadc_Adc_Group Group Functions
 * \ingroup IfxLld_Evadc_Adc
 * \defgroup IfxLld_Evadc_Adc_Channel Channel Functions
 * \ingroup IfxLld_Evadc_Adc
 * \defgroup IfxLld_Evadc_Adc_Queue Queue Functions
 * \ingroup IfxLld_Evadc_Adc
 * \defgroup IfxLld_Evadc_Adc_Clock Clock Functions
 * \ingroup IfxLld_Evadc_Adc
 * \defgroup IfxLld_Evadc_Adc_Interrupt Interrupt Functions
 * \ingroup IfxLld_Evadc_Adc
 * \defgroup IfxLld_Evadc_Adc_Variables Variables
 * \ingroup IfxLld_Evadc_Adc
 * \defgroup IfxLld_Evadc_Adc_Global Global Functions
 * \ingroup IfxLld_Evadc_Adc
 * \defgroup IfxLld_Evadc_Adc_Emux Emux Functions
 * \ingroup IfxLld_Evadc_Adc
 * \defgroup IfxLld_Evadc_Adc_FastCompare Fast Compare Functions
 * \ingroup IfxLld_Evadc_Adc
 */

