feaser/openblt/stm32u5_port/Target/Demo/TRICORE_TC3_TC375_Lite_Kit_ADS/Boot/Libraries/iLLD/TC37A/Tricore/Evadc/Adc/IfxEvadc_Adc.h
#ifndef IFXEVADC_ADC_H
#define IFXEVADC_ADC_H 1

/******************************************************************************/
/*----------------------------------Includes----------------------------------*/
/******************************************************************************/

#include "Evadc/Std/IfxEvadc.h"
#include "_Utilities/Ifx_Assert.h"

/******************************************************************************/
/*------------------------------Type Definitions------------------------------*/
/******************************************************************************/

typedef uint8 IfxEvadc_Adc_SYNCTR_STSEL;

/******************************************************************************/
/*-----------------------------Data Structures--------------------------------*/
/******************************************************************************/

/** \addtogroup IfxLld_Evadc_Adc_DataStructures
 * \{ */
/** \brief EVADC handle data structure
 */
typedef struct
{
    Ifx_EVADC *evadc;       /**< \brief Specifies the pointer to the EVADC module registers */
} IfxEvadc_Adc;

/** \brief Gating/Trigger configuration structure
 */
typedef struct
{
    IfxEvadc_GatingSource  gatingSource;        /**< \brief Specifies used gate input for group */
    IfxEvadc_TriggerSource triggerSource;       /**< \brief Specifies used Trigger input for group */
    IfxEvadc_GatingMode    gatingMode;          /**< \brief Specifies gating mode. High level, Low Level  or Gating disabled */
    IfxEvadc_TriggerMode   triggerMode;         /**< \brief Specifies trigger mode. Rising, falling any edge leads to an trigger event */
} IfxEvadc_Adc_GatingTriggerConfig;

/** \} */

/** \addtogroup IfxLld_Evadc_Adc_DataStructures
 * \{ */
/** \brief Arbiter configuration structure.
 */
typedef struct
{
    IfxEvadc_ArbitrationRounds arbiterRoundLength;             /**< \brief Specifies arbiter round length. */
    boolean                    requestSlotQueue0Enabled;       /**< \brief request queue0 if enabled. */
    boolean                    requestSlotQueue1Enabled;       /**< \brief request queue1 if enabled. */
    boolean                    requestSlotQueue2Enabled;       /**< \brief request queue2 if enabled. */
} IfxEvadc_Adc_ArbiterConfig;

/** \brief Input class configuration structure
 */
typedef struct
{
    float32                                                sampleTime;                                /**< \brief Specifies the requested sample time for input class */
    IfxEvadc_ChannelNoiseReduction                         conversionMode;                            /**< \brief Specifies the conversion Mode, noise reduction levels */
    IfxEvadc_SpreadEarlySamplePointStandardConversionsMode samplePointStandard;
    IfxEvadc_AnalogInputPrechargeControl                   analogInputPrechargeControlStandard;
    float32                                                sampleTimeEMUX;
    IfxEvadc_ChannelNoiseReductionEMUX                     conversionModeEMUX;
    IfxEvadc_SpreadEarlySamplePointEMUXConversionsMode     samplePointEMUX;
    IfxEvadc_AnalogInputPrechargeControl                   analogInputPrechargeControlEMUX;
} IfxEvadc_Adc_ClassConfig;

typedef struct
{
    IfxEvadc_Emux_Out *pins[3];          /**< \brief Emux Pins configuration */
    IfxPort_OutputMode outputMode;       /**< \brief the pin output mode which should be configured */
    IfxPort_PadDriver  padDriver;        /**< \brief Pad driver */
} IfxEvadc_Adc_EmuxPinConfig;

/** \brief Group handle data structure
 */
typedef struct
{
    IfxEvadc_Adc     module;        /**< \brief The EVADC handle structure */
    Ifx_EVADC_G     *group;         /**< \brief Pointer to the group registers */
    IfxEvadc_GroupId groupId;       /**< \brief Specifies the group index */
} IfxEvadc_Adc_Group;

/** \brief Queue configuration structure
 */
typedef struct
{
    boolean                          flushQueueAfterInit;        /**< \brief Specifies if the queue is flushed after configuration */
    IfxEvadc_Adc_GatingTriggerConfig triggerConfig;              /**< \brief trigger and gating configuration. */
    IfxEvadc_RequestSlotPriority     requestSlotPrio;            /**< \brief priority of used  queue request slot. */
    IfxEvadc_RequestSlotStartMode    requestSlotStartMode;       /**< \brief start mode for request queue source. */
} IfxEvadc_Adc_QueueConfig;

/** \} */

/** \addtogroup IfxLld_Evadc_Adc_DataStructures
 * \{ */
/** \brief Channel handle data structure
 */
typedef struct
{
    IfxEvadc_ChannelId            channel;         /**< \brief Specifies the channel index */
    IfxEvadc_ChannelResult        resultreg;       /**< \brief Specifies allocated result register */
    IFX_CONST IfxEvadc_Adc_Group *group;           /**< \brief Specifies the group of the channel */
} IfxEvadc_Adc_Channel;

/** \brief Channel configuration structure
 */
typedef struct
{
    boolean                           globalResultUsage;              /**< \brief Specifies storage in global result register */
    boolean                           synchonize;                     /**< \brief Specifies synchronized conversion channel */
    boolean                           rightAlignedStorage;            /**< \brief Specifies result is right aligned */
    Ifx_Priority                      resultPriority;                 /**< \brief Interrupt priority of the result trigger interrupt, if 0 the interrupt is disable */
    Ifx_Priority                      channelPriority;                /**< \brief Interrupt priority of the channel trigger interrupt, if 0 the interrupt is disable */
    IfxSrc_Tos                        resultServProvider;             /**< \brief Interrupt service provider for the result trigger interrupt */
    IfxSrc_Tos                        channelServProvider;            /**< \brief Interrupt service provider for the channel trigger interrupt */
    IfxEvadc_SrcNr                    resultSrcNr;                    /**< \brief Service node of the result trigger */
    IfxEvadc_SrcNr                    channelSrcNr;                   /**< \brief Service node of the channel trigger */
    IfxEvadc_ChannelId                channelId;                      /**< \brief Specifies the channel index */
    IfxEvadc_InputClasses             inputClass;                     /**< \brief Specifies input class selection */
    IfxEvadc_ChannelReference         reference;                      /**< \brief Specifies Reference selection */
    IfxEvadc_ChannelResult            resultRegister;                 /**< \brief Specifies Result register selection */
    IfxEvadc_BoundarySelection        lowerBoundary;                  /**< \brief Specifies lower boundary selection */
    IfxEvadc_BoundarySelection        upperBoundary;                  /**< \brief Specifies upper boundary selection */
    IfxEvadc_BoundaryExtension        boundaryMode;                   /**< \brief Specifies Standard mode of fast compare mode */
    IfxEvadc_LimitCheck               limitCheck;                     /**< \brief Specifies boundary band selection upper/lower */
    IFX_CONST IfxEvadc_Adc_Group     *group;                          /**< \brief Specifies pointer to the IfxEvadc_Adc_Group group handle */
    IfxEvadc_DataModificationMode     dataModificationMode;           /**< \brief Specifies the Data Modification Mode.According to the value entered here, the meanings of values entered for dataReductionControlMode will mean either the number of results accumulated(GxRCRy.B.DMM=0) or filter coefficients(GxRCRy.B.DMM=1). */
    IfxEvadc_DataReductionControlMode dataReductionControlMode;       /**< \brief Depending on the valued of dataModificationMode, the meanings of values in this will differ.For details refer definition of IfxEvadc_DataReductionControlMode enum in IfxEvadc.h */
    IfxEvadc_WaitForRead              waitForReadMode;
    IfxEvadc_FifoMode                 fifoMode;
} IfxEvadc_Adc_ChannelConfig;

