feaser/openblt/stm32u5_port/Target/Demo/TRICORE_TC3_TC375_Lite_Kit_ADS/Boot/Libraries/iLLD/TC37A/Tricore/Evadc/Adc/IfxEvadc_Adc.h
/** \brief EVADC module configuration structure
 */
typedef struct
{
    Ifx_EVADC                         *evadc;                                                    /**< \brief Specifies the pointer to the EVADC module registers */
    IfxEvadc_Adc_ClassConfig           globalInputClass[IFXEVADC_NUM_GLOBAL_INPUTCLASSES];       /**< \brief Specifies the global conversion settings one and two */
    IfxEvadc_AnalogClockGenerationMode analogClockGenerationMode;
    IfxEvadc_SupplyVoltageLevelControl supplyVoltage;
    IfxEvadc_StartupCalibration        startupCalibrationControl;
} IfxEvadc_Adc_Config;

/** \brief Emux Control Structure
 */
typedef struct
{
    Ifx_EVADC                       *evadc;                       /**< \brief Pointer to EVADC Module Space */
    IfxEvadc_ExternalMultiplexerMode mode;                        /**< \brief Specifies the External Multiplexer mode */
    IfxEvadc_EmuxSelectValue         startChannel;                /**< \brief specifies the external channel start value(EMUX[x:0])
                                                                   * x- specifies external channel number */
    IfxEvadc_EmuxCodingScheme        code;                        /**< \brief specifes binary/gray code */
    IfxEvadc_EmuxSampleTimeControl   sampleTimeControl;           /**< \brief specifies when to use sample time control */
    IfxEvadc_GroupId                 groupId;                     /**< \brief specifies groupId */
    uint8                            channels;                    /**< \brief specifies channel number */
    IfxEvadc_EmuxInterface           emuxInterface;               /**< \brief specifies the Emux interface */
    IfxEvadc_Adc_EmuxPinConfig       emuxOutPinConfig;            /**< \brief configure the emux output pin */
    IfxEvadc_ChannelSelectionStyle   channelSelectionStyle;       /**< \brief External Multiplexer Channel Selection Style */
} IfxEvadc_Adc_EmuxControl;

/** \brief Group configuration structure
 */
typedef struct
{
    IFX_CONST IfxEvadc_Adc                  *module;                                      /**< \brief Specifies pointer to the IfxEvadc_Adc module handle */
    IfxEvadc_GroupId                         groupId;                                     /**< \brief Specifies the group/kernel id */
    IfxEvadc_GroupId                         master;                                      /**< \brief Specifies the master group. If master is different from groupId, then the group is configured as slave. */
    IfxEvadc_Adc_ClassConfig                 inputClass[IFXEVADC_NUM_INPUTCLASSES];       /**< \brief Specifies conversion settings one and two */
    IfxEvadc_Adc_QueueConfig                 queueRequest[3];                             /**< \brief Specifies queue0 mode configuration */
    IfxEvadc_Adc_ArbiterConfig               arbiter;                                     /**< \brief Arbiter configuration structure. */
    float32                                  analogFrequency;                             /**< \brief specifies analog frequency in Hz */
    boolean                                  startupCalibration;                          /**< \brief Can be enabled to execute a startup calibration (disabled by default). */
    boolean                                  disablePostCalibration;                      /**< \brief Specifies if calibration after conversion (post calibration) should be disabled */
    IfxEvadc_InputClasses                    inputClasses;
    boolean                                  doubleClockForMSBConversionSelection;
    IfxEvadc_SampleSynchronization           sampleSynchronizationEnabled;
    IfxEvadc_AnalogClockSynchronizationDelay analogClockSynchronizationDelay;
    IfxEvadc_CalibrationSampleTimeControl    calibrationSampleTimeControlMode;
    IfxEvadc_ReferencePrechargeControl       referencePrechargeControlMode;
    boolean                                  referencePrechargeEnabled;
    boolean                                  inputBufferEnabled;
    IfxEvadc_IdlePrecharge                   idlePrechargeLevel;                          /**< \brief Voltage level to which sampling capacitor will be precharged when idle. */
    IfxEvadc_AnalogConverterMode             analogConverterMode;
} IfxEvadc_Adc_GroupConfig;

/** \} */

/** \addtogroup IfxLld_Evadc_Adc_FastCompare
 * \{ */
typedef struct
{
    IfxEvadc_Adc     module;                     /**< \brief The EVADC handle structure */
    Ifx_EVADC_FC    *fastCompareChannel;
    IfxEvadc_GroupId fastCompareChannelId;       /**< \brief Following values can be taken for fastCompareChannelId:
                                                  *
                                                  *     IfxEvadc_GroupId_12 for Fast compare channel 0
                                                  *     IfxEvadc_GroupId_13 for Fast compare channel 1
                                                  *     IfxEvadc_GroupId_14 for Fast compare channel 2
                                                  *     IfxEvadc_GroupId_15 for Fast compare channel 3
                                                  *     IfxEvadc_GroupId_16 for Fast compare channel 4
                                                  *     IfxEvadc_GroupId_17 for Fast compare channel 5
                                                  *     IfxEvadc_GroupId_18 for Fast compare channel 6
                                                  *     IfxEvadc_GroupId_19 for Fast compare channel 7 */
} IfxEvadc_Adc_FastCompareChannel;

/** \brief Configuring Fast Compare channel operations
 */
typedef struct
{
    IfxEvadc_Adc                                       *module;                                /**< \brief Pointer to EVADC module handle */
    IfxEvadc_GroupId                                    fastCompareChannelId;
    IfxEvadc_BoundaryFlagActivationMode                 boundaryFlagActivation;                /**< \brief Selects the behaviour of BoundaryFlag in FCBFL.B.BFA */
    IfxEvadc_BoundaryFlagInversionControl               boundaryFlagInversion;                 /**< \brief Select whether to use Boundary Flag(FCM.B.BFL) directly or in a inverted format */
    IfxEvadc_BoundaryFlagNodePointer                    boundaryFlagNodePointer;               /**< \brief Options for FCM.B.BFLNP to select Boundary Flag Node Pointer */
    IfxEvadc_BoundaryFlagSwControl                      boundaryFlagAction;                    /**< \brief Action to be performed on the boundary flag(BFL) */
    IfxEvadc_ChannelEventMode                           channelEventMode;                      /**< \brief Channel Event Mode for configuring generation of events for Fast Compare channels in FCCTRL.B.CHEVMODE */
    IfxEvadc_ClockDividerFactor                         clockDivider;                          /**< \brief Defines the frequency of the analog converter clock f_ADCI (base clock for conversion steps), derived from the peripheral clock. */
    IfxEvadc_ExternalTriggerPolarity                    externalTriggerPolarity;               /**< \brief External Trigger Polarity to be set in FCCTRL.B.XTPOL */
    IfxEvadc_FastCompareAnalogClockSynchronizationDelay delay;                                 /**< \brief Defines the delay of the analog clock in clocks after the sync signal in FCM.B.ACSD */
    IfxEvadc_FastCompareAnalogConverterControl          analogConverterControllerMode;         /**< \brief Settings for Analog Coverter Controller to be done in FCM.B.ANON */
    IfxEvadc_FastCompareAutomaticUpdate                 automaticUpdateMode;                   /**< \brief Defines the source of the value(s) in bitfield FCM.B.FCREF */
    IfxEvadc_FastCompareRunControl                      runMode;
    IfxEvadc_RampRunControl                             rampGenerationMode;                    /**< \brief Defines the run conditions for the ramp generation in FCM.B.RUNRAMP */
    IfxEvadc_FastCompareServiceRequestGeneration        serviceRequestGenerationEvent;         /**< \brief Criteria/mode settings for service request generation in FCM.B.SRG */
    IfxEvadc_GateOperatingMode                          gateOperatingMode;                     /**< \brief Gate Operating Mode to be filled in FCCTRL.B.GTMODE */
    IfxEvadc_RampDirection                              rampDirection;                         /**< \brief Ramp direction setting in FCM.B.FCRDIR */
    IfxEvadc_SampleSynchronization                      sampleTimingSynchronization;           /**< \brief Sample timing sync settings for FCM.B.SSE */
    IfxEvadc_TriggerOperatingMode                       externalTriggerOperatingMode;          /**< \brief Trigger operating mode in Fast Compare channels, to be entered in FCCTRL.B.XTMODE */
    uint8                                               additionalClockCycles;                 /**< \brief Number of additional clock cycles to be added to the minimum sample phase of 2 analog clock cycles. */
    IfxEvadc_ReferencePrechargeControl                  referenceInputPrechargeDuration;       /**< \brief Precharge duration for the reference input */
    IfxEvadc_AnalogInputPrechargeControl                analogInputPrechargeDuration;          /**< \brief Precharge duration for the analog input */
    uint8                                               triggerInterval;                       /**< \brief Defines the interval at which fast compare operations are triggered in steps of 16 * 1/f_ADC */
    uint16                                              referenceValue;                        /**< \brief The input level is compared to this value.
                                                                                                * The resulting reference level is (V_AREF / 1024) * FCM.B.FCREF */
    boolean                                             boundaryFlagValue;                     /**< \brief Defines the logic value that replaces the compare result while the gate input is inactive (low) in lock mode. */
} IfxEvadc_Adc_FastCompareChannelConfig;

