feaser/openblt/stm32u5_port/Target/Demo/TRICORE_TC3_TC375_Lite_Kit_ADS/Boot/Libraries/iLLD/TC37A/Tricore/Evadc/Adc/IfxEvadc_Adc.h
/** \brief Reset the EVADC group
 * \param group pointer to the EVADC group
 * \return None
 *
 * Example Usage :\ref IfxLld_Evadc_Adc_Usage
 *
 */
IFX_EXTERN void IfxEvadc_Adc_deInitGroup(IfxEvadc_Adc_Group *group);

/** \brief Get the current group configuration (e.g. evadc frequency)
 * \param group pointer to the EVADC group
 * \param config pointer to the EVADC group configuration
 * \return None
 *
 * Example Usage :\ref IfxLld_Evadc_Adc_Usage
 *
 */
IFX_EXTERN void IfxEvadc_Adc_getGroupConfig(IfxEvadc_Adc_Group *group, IfxEvadc_Adc_GroupConfig *config);

/** \brief Initialise the EVADC group (also  queue modes) Slave Groups must initialize first.
 * \param group Pointer to the EVADC group
 * \param config pointer to the EVADC group configuration
 * \return IfxEvadc_Status
 *
 * For coding example see: \ref IfxLld_Evadc_Adc_Usage
 *
 */
IFX_EXTERN IfxEvadc_Status IfxEvadc_Adc_initGroup(IfxEvadc_Adc_Group *group, const IfxEvadc_Adc_GroupConfig *config);

/** \brief Initialise buffer with default EVADC configuration
 *
 * NOTE: By default startupCalibration = FALSE in IfxEvadc_Adc_initGroupConfig() and startupCalibrationControl = IfxEvadc_StartupCalibration_noAction in IfxEvadc_Adc_initModuleConfig().
 *
 * In case startup calibration is required, while configuring the last group, startupCalibration inside group config structure must be set to TRUE after calling IfxEvadc_Adc_initGroupConfig() and before calling IfxEvadc_Adc_initGroup().
 * \param config pointer to the EVADC group configuration
 * \param evadc Pointer to the EVADC module
 * \return None
 *
 * For coding example see: \ref IfxLld_Evadc_Adc_Usage
 *
 */
IFX_EXTERN void IfxEvadc_Adc_initGroupConfig(IfxEvadc_Adc_GroupConfig *config, IfxEvadc_Adc *evadc);

/** \} */

/** \addtogroup IfxLld_Evadc_Adc_Channel
 * \{ */

/******************************************************************************/
/*-------------------------Inline Function Prototypes-------------------------*/
/******************************************************************************/

/** \brief pointer to the EVADC channel
 * \param channel pointer to the EVADC channel
 * \param waitForReadMode wait for read mode enabled/disable
 * \return None
 *
 * For coding example see: \ref IfxEvadc_Adc_getResultBasedOnRequestSource
 *
 */
IFX_INLINE void IfxEvadc_Adc_configureWaitForReadMode(IfxEvadc_Adc_Channel *channel, boolean waitForReadMode);

/** \brief Get conversion result (Function does not care about the alignment)
 * \param channel pointer to the EVADC channel
 * \return scaled Conversion result
 *
 * For coding example see: \ref IfxLld_Evadc_Adc_Usage
 *
 */
IFX_INLINE Ifx_EVADC_G_RES IfxEvadc_Adc_getResult(IfxEvadc_Adc_Channel *channel);

/******************************************************************************/
/*-------------------------Global Function Prototypes-------------------------*/
/******************************************************************************/

/** \brief Get the current channel configuration (e.g. sample settings)
 * \param channel pointer to the EVADC channel
 * \param config pointer to the EVADC channel configuration
 * \return None
 *
 * Example Usage :\ref IfxLld_Evadc_Adc_Usage
 *
 */
IFX_EXTERN void IfxEvadc_Adc_getChannelConfig(IfxEvadc_Adc_Channel *channel, IfxEvadc_Adc_ChannelConfig *config);

/** \brief Initialise one channel with given configuration
 * \param channel pointer to the EVADC channel
 * \param config pointer to the EVADC channel configuration
 * \return IfxEvadc_Status
 *
 * For coding example see: \ref IfxLld_Evadc_Adc_Usage
 *
 */
IFX_EXTERN IfxEvadc_Status IfxEvadc_Adc_initChannel(IfxEvadc_Adc_Channel *channel, const IfxEvadc_Adc_ChannelConfig *config);

/** \brief Initialise buffer with default channel configuration
 * \param config pointer to the EVADC channel configuration
 * \param group pointer to the EVADC group
 * \return None
 *
 * For coding example see: \ref IfxLld_Evadc_Adc_Usage
 *
 */
IFX_EXTERN void IfxEvadc_Adc_initChannelConfig(IfxEvadc_Adc_ChannelConfig *config, const IfxEvadc_Adc_Group *group);

/** \} */

/** \addtogroup IfxLld_Evadc_Adc_Queue
 * \{ */

/******************************************************************************/
/*-------------------------Inline Function Prototypes-------------------------*/
/******************************************************************************/

/** \brief Add an entry to the queue of a group for the specified channel with the following options set:
 *  refill
 *  source interrupt enable/disable
 * external trigger control
 * \param channel pointer to the EVADC channel
 * \param sourceType Request source Type(Queue 0,Queue 1,Queue 2)
 * \param options options for channel
 * \return None
 *
 * For coding example see: \ref IfxEvadc_Adc_getResult
 *
 */
IFX_INLINE void IfxEvadc_Adc_addToQueue(IfxEvadc_Adc_Channel *channel, IfxEvadc_RequestSource sourceType, uint32 options);

/** \brief Flush the contents of the queue of a group
 * \param group pointer to the EVADC group
 * \param sourceType Request source Type(Queue 0,Queue 1,Queue 2)
 * \return None
 *
 * For coding example see: \ref IfxEvadc_Adc_getResult
 *
 */
IFX_INLINE void IfxEvadc_Adc_clearQueue(IfxEvadc_Adc_Group *group, IfxEvadc_RequestSource sourceType);

/** \brief Gives the status of the Queue of a group by returning non zero value if the Queue is full
 * \param group pointer to the EVADC group
 * \param sourceType Request source Type(Queue 0,Queue 1,Queue 2)
 * \return Queue status
 *
 * For coding example see: \ref IfxEvadc_Adc_getResult
 *
 */
IFX_INLINE IfxEvadc_Status IfxEvadc_Adc_getQueueStatus(IfxEvadc_Adc_Group *group, IfxEvadc_RequestSource sourceType);

/** \brief Starts a queue of a group by generating a trigger event through software
 * \param group pointer to the EVADC group
 * \param sourceType Request source Type(Queue 0,Queue 1,Queue 2)
 * \return None
 *
 * For coding example see: \ref IfxEvadc_Adc_getResult
 *
 */
IFX_INLINE void IfxEvadc_Adc_startQueue(IfxEvadc_Adc_Group *group, IfxEvadc_RequestSource sourceType);

