feaser/openblt/stm32u5_port/Target/Demo/TRICORE_TC3_TC375_Lite_Kit_ADS/Boot/Libraries/iLLD/TC37A/Tricore/Evadc/Adc/IfxEvadc_Adc.h
/** \} */

/** \addtogroup IfxLld_Evadc_Adc_Global
 * \{ */

/******************************************************************************/
/*-------------------------Inline Function Prototypes-------------------------*/
/******************************************************************************/

/** \brief access function to enable/disable  wait for read mode for global result register
 * \param evadc pointer to the EVADC module
 * \param waitForReadMode wait for read mode enabled/disabled
 * \return None
 *
 * For coding example see: \ref IfxEvadc_Adc_getGlobalResult
 *
 */
IFX_INLINE void IfxEvadc_Adc_configureWaitForReadModeForGlobalResultRegister(IfxEvadc_Adc *evadc, boolean waitForReadMode);

/** \brief returns result stored in global result register
 * \param evadc pointer to the EVADC module
 * \return global result register
 *
 * \code
 * // create configuration
 * IfxEvadc_Adc_Config adcConfig;
 * IfxEvadc_Adc_initModuleConfig(&adcConfig, &MODULE_EVADC);
 *
 * // initialize module
 * IfxEvadc_Adc evadc;
 * IfxEvadc_Adc_initModule(&evadc, &adcConfig);
 *
 * // create group config
 * IfxEvadc_Adc_GroupConfig adcGroupConfig;
 * IfxEvadc_Adc_initGroupConfig(&adcGroupConfig, &evadc);
 *
 * // change group (default is GroupId_0, change to GroupId_3)
 * adcGroupConfig.groupId = IfxEvadc_GroupId_3;
 *
 * // IMPORTANT: usually we use the same group as master!
 * adcGroupConfig.master = adcGroupConfig.groupId;
 *
 * // initialize the group
 * IfxEvadc_Adc_Group adcGroup;
 * IfxEvadc_Adc_initGroup(&adcGroup, &adcGroupConfig);
 *
 * // create channel config
 * IfxEvadc_Adc_ChannelConfig adcChannelConfig2;
 * IfxEvadc_Adc_initChannelConfig(&adcChannelConfig2, &adcGroup);
 * adcChannelConfig2.backgroundChannel   = TRUE;
 * adcChannelConfig2.globalResultUsage   = TRUE;
 *
 * // change channel (default is ChannelId0, change to ChannelId2)
 * adcChannelConfig2.channelId = IfxEvadc_ChannelId2;
 *
 * // initialize the channel
 * IfxEvadc_Adc_Channel adcChannel2;
 * IfxEvadc_Adc_initChannel(&adcChannel2, &adcChannelConfig2);
 *
 * // create channel config
 * IfxEvadc_Adc_ChannelConfig adcChannelConfig5;
 * IfxEvadc_Adc_initChannelConfig(&adcChannelConfig5, &adcGroup);
 * adcChannelConfig5.backgroundChannel   = TRUE;
 * adcChannelConfig5.globalResultUsage   = TRUE;
 *
 * // change channel (default is ChannelId0, change to ChannelId5)
 * adcChannelConfig5.channelId = IfxEvadc_ChannelId5;
 *
 *
 * // initialize the channel
 * IfxEvadc_Adc_Channel adcChannel5;
 * IfxEvadc_Adc_initChannel(&adcChannel5, &adcChannelConfig5);
 *
 * uint32 channels = (1 << 5) | (1 << 2); // enable channel #5 and #2
 * uint32 mask = (1 << 7) | (1 << 5) | (1 << 2); // modify the selection for channel #7, #5 and #2; channel #7 will be disabled
 *
 * //configure wait for read mode
 * IfxEvadc_Adc_configureWaitForReadModeForGlobalResultRegister(&evadc, TRUE);
 *
 *      // Add channel to queue with refill enabled
 *             IfxEvadc_Adc_addToQueue(&adcChannel[chnIx],  IfxEvadc_RequestSource_queue0, IFXEVADC_QUEUE_REFILL);
 *
 *     // start the Queue
 *         IfxEvadc_Adc_startQueue(&adcGroup, IfxEvadc_RequestSource_queue0); // just for the case that somebody copy&pastes the code - the queue has already been started in previous test
 *
 *
 * // wait for valid result for channel 2
 * Ifx_EVADC_GLOB.RES resultChannel2;
 * do {
 * resultChannel2 = IfxEvadc_Adc_getGlobalResult(&evadc);
 * } while( !resultChannel2.B.VF );
 *
 * // wait for valid result for channel 5
 * Ifx_EVADC_GLOB.RES resultChannel5;
 * do {
 *     resultChannel5 = IfxEvadc_Adc_getGlobalResult(&evadc);
 * } while( !resultChannel5.B.VF );
 * \endcode
 *
 */
IFX_INLINE Ifx_EVADC_GLOB_RES IfxEvadc_Adc_getGlobalResult(IfxEvadc_Adc *evadc);

/******************************************************************************/
/*-------------------------Global Function Prototypes-------------------------*/
/******************************************************************************/

/** \brief Configure global settings in the GLOBCFG register
 * \param evadc Pointer to EVADC SFRs
 * \param config pointer to the EVADC module configuration
 * \return None
 */
IFX_EXTERN void IfxEvadc_Adc_setGlobalConfigurations(Ifx_EVADC *evadc, const IfxEvadc_Adc_Config *config);

/** \} */

/** \addtogroup IfxLld_Evadc_Adc_Emux
 * \{ */

/******************************************************************************/
/*-------------------------Global Function Prototypes-------------------------*/
/******************************************************************************/

/** \brief initalise external multiplexer.
 * \param evadc Pointer to EVADC Module space
 * \param emuxControl speciifies EMUX configuration
 * \return None
 */
IFX_EXTERN void IfxEvadc_Adc_initExternalMultiplexerMode(Ifx_EVADC *evadc, const IfxEvadc_Adc_EmuxControl *emuxControl);

/** \brief initialise default configuration for external multiplexer
 * \param emuxConfig speciifies EMUX configuration
 * \param evadc pointer to EVADC module space
 * \return None
 */
IFX_EXTERN void IfxEvadc_Adc_initExternalMultiplexerModeConfig(IfxEvadc_Adc_EmuxControl *emuxConfig, Ifx_EVADC *evadc);

/** \} */

/** \addtogroup IfxLld_Evadc_Adc_FastCompare
 * \{ */

/******************************************************************************/
/*-------------------------Global Function Prototypes-------------------------*/
/******************************************************************************/

/** \brief Initializing the Fast Compare channel.
 * \param fastCompareChannel Pointer to the EVADC Fast Compare Channel group
 * \param config Pointer to the EVADC Fast Compare Channel  configuration structure
 * \return None
 */
IFX_EXTERN void IfxEvadc_Adc_initFastCompareChannel(IfxEvadc_Adc_FastCompareChannel *fastCompareChannel, IfxEvadc_Adc_FastCompareChannelConfig *config);

/** \brief Initializing Fast Compare Channel config structure with default configurations
 * \param config pointer to the EVADC fast compare channel configuration structure
 * \param evadc Pointer to the EVADC module
 * \return None
 */
IFX_EXTERN void IfxEvadc_Adc_initFastCompareChannelConfig(IfxEvadc_Adc_FastCompareChannelConfig *config, IfxEvadc_Adc *evadc);

