feaser/openblt/stm32u5_port/Target/Demo/TRICORE_TC3_TC375_Lite_Kit_ADS/Boot/Libraries/iLLD/TC37A/Tricore/Evadc/Adc/IfxEvadc_Adc.h
/** \} */

/******************************************************************************/
/*-------------------------Global Function Prototypes-------------------------*/
/******************************************************************************/

/** \brief set analog converter mode
 * \param evadc Pointer to module space
 * \param group Pointer to evadc group
 * \param analogConverterMode specifies analog convert mode
 * \return None
 */
IFX_EXTERN void IfxEvadc_Adc_setAnalogConvertControl(Ifx_EVADC *evadc, IfxEvadc_Adc_Group *group, IfxEvadc_AnalogConverterMode analogConverterMode);

/******************************************************************************/
/*---------------------Inline Function Implementations------------------------*/
/******************************************************************************/

IFX_INLINE void IfxEvadc_Adc_addToQueue(IfxEvadc_Adc_Channel *channel, IfxEvadc_RequestSource sourceType, uint32 options)
{
    IfxEvadc_addToQueue(channel->group->group, channel->channel, sourceType, options);
}


IFX_INLINE void IfxEvadc_Adc_clearQueue(IfxEvadc_Adc_Group *group, IfxEvadc_RequestSource sourceType)
{
    IfxEvadc_clearQueue(group->group, TRUE, sourceType);
}


IFX_INLINE void IfxEvadc_Adc_configureWaitForReadMode(IfxEvadc_Adc_Channel *channel, boolean waitForReadMode)
{
    IfxEvadc_configureWaitForReadMode(channel->group->group, channel->resultreg, waitForReadMode);
}


IFX_INLINE void IfxEvadc_Adc_configureWaitForReadModeForGlobalResultRegister(IfxEvadc_Adc *evadc, boolean waitForReadMode)
{
    IfxEvadc_configureWaitForReadModeForGlobalResultRegister(evadc->evadc, waitForReadMode);
}


IFX_INLINE void IfxEvadc_Adc_deInitModule(IfxEvadc_Adc *evadc)
{
    Ifx_EVADC *evadcSFR = evadc->evadc;

    IfxEvadc_resetModule(evadcSFR);
}


IFX_INLINE Ifx_EVADC *IfxEvadc_Adc_getEvadcFromGroup(const IfxEvadc_Adc_Group *group)
{
    return group->module.evadc;
}


IFX_INLINE Ifx_EVADC_GLOB_RES IfxEvadc_Adc_getGlobalResult(IfxEvadc_Adc *evadc)
{
    return IfxEvadc_getGlobalResult(evadc->evadc);
}


IFX_INLINE Ifx_EVADC_G *IfxEvadc_Adc_getGroupRegsFromGroup(const IfxEvadc_Adc_Group *group)
{
    return group->group;
}


IFX_INLINE void IfxEvadc_Adc_getGroupResult(IfxEvadc_Adc_Group *group, Ifx_EVADC_G_RES *results, uint32 resultOffset, uint32 numResults)
{
    IfxEvadc_getGroupResult(group->group, results, resultOffset, numResults);
}


IFX_INLINE void IfxEvadc_Adc_getModuleConfig(IfxEvadc_Adc *evadc, IfxEvadc_Adc_Config *config, Ifx_EVADC_G *evadcG)
{
    IFX_UNUSED_PARAMETER(evadcG);
    config->evadc                              = evadc->evadc;
    config->globalInputClass[0].conversionMode = IfxEvadc_getGlobalConversionMode(evadc->evadc, 0);
    config->globalInputClass[1].conversionMode = IfxEvadc_getGlobalConversionMode(evadc->evadc, 1);
}


IFX_INLINE IfxEvadc_Status IfxEvadc_Adc_getQueueStatus(IfxEvadc_Adc_Group *group, IfxEvadc_RequestSource sourceType)
{
    return IfxEvadc_getQueueStatus(group->group, sourceType);
}


IFX_INLINE Ifx_EVADC_G_RES IfxEvadc_Adc_getResult(IfxEvadc_Adc_Channel *channel)
{
    return IfxEvadc_getResult(channel->group->group, channel->resultreg);
}


IFX_INLINE Ifx_EVADC_G_RES IfxEvadc_Adc_getResultBasedOnRequestSource(IfxEvadc_Adc_Group *group, IfxEvadc_ChannelId channel, IfxEvadc_RequestSource sourceType)
{
    return IfxEvadc_getResultBasedOnRequestSource(group->module.evadc, group->group, channel, sourceType);
}


IFX_INLINE void IfxEvadc_Adc_startQueue(IfxEvadc_Adc_Group *group, IfxEvadc_RequestSource sourceType)
{
    IfxEvadc_startQueue(group->group, sourceType);
}


#endif /* IFXEVADC_ADC_H */
